"""关于天干地支的各种计算集中在这里。
"""

_TIANGAN = [
    {
        "name": "甲",
    }, {
        "name": "乙",
    }, {
        "name": "丙",
    }, {
        "name": "丁",
    }, {
        "name": "戊",
    }, {
        "name": "己",
    }, {
        "name": "庚",
    }, {
        "name": "辛",
    }, {
        "name": "壬",
    }, {
        "name": "癸",
    }
]

_DIZHI = [
    {
        "name": "子",
    }, {
        "name": "丑",
    }, {
        "name": "寅",
    }, {
        "name": "卯",
    }, {
        "name": "辰",
    }, {
        "name": "巳",
    }, {
        "name": "午",
    }, {
        "name": "未",
    }, {
        "name": "申",
    }, {
        "name": "酉",
    }, {
        "name": "戌",
    }, {
        "name": "亥",
    }
]
